src/Catalogs/ММ_КаналыУведомлений/ММ_КаналыУведомлений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ММ_КаналыУведомлений</name>
  <attributes>
    <name>ChatId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьПоТелеграм</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УведомитьПоПочте</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Почта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BitrixId</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УведомлятьBitrix</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/ММ_КаналыУведомлений/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.Почта.Видимость = Объект.УведомитьПоПочте;
	Элементы.ChatId.Видимость = Объект.УведомитьПоТелеграм;
	Элементы.BitrixId.Видимость = Объект.УведомлятьBitrix;
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура УведомитьПоТелеграмПриИзменении(Элемент)
	Элементы.ChatId.Видимость = Объект.УведомитьПоТелеграм;
КонецПроцедуры

&НаКлиенте
Процедура УведомитьПоПочтеПриИзменении(Элемент)
	Элементы.Почта.Видимость = Объект.УведомитьПоПочте;
КонецПроцедуры

&НаКлиенте
Процедура УведомлятьBitrixПриИзменении(Элемент)
	Элементы.BitrixId.Видимость = Объект.УведомлятьBitrix;
КонецПроцедуры
#КонецОбласти
